package basis;

/* 
     多行注释 布局 
*/
//单行注释


public class ZhiFuChuan {
	
	public static void main(String[] args) {
	    //  标识符
		//java程序中用来表示类名，变量名，方法名，类型名，数组名，文件名的有效字符序列称为标识符。
		//标识符的命名规则
		//一个合法的标识符只能由：字母、数字、下划线、美元符 组成，不能含有其他符号；
		//不能以数字开头；
		//严格区分大小写；
		//关键字不能做标识符；
		//理论上没有长度限制，但最好不要太长。
		//标识符的命名规范
		//见名知意，看见这个标识符的名字就知道它的意思或者作用；
		//遵守驼峰命名方式，如：SysteamService；
		//类名、接口名：首字母大写，后面每个单词首字母大写（驼峰命名法）；
		//变量名、方法名：首字母小写，后面每个单词首字母大写；
		//常量名：全部大写。
		
		
		
		
		//关键字
		//关键字  最好是见名知意
		//Java语言里已经定于好的，有特别意义的标识符，有时又叫保留字，还有特别意义的变量。
		//Java的关键字对Java的编译器有特殊的意义，他们用来表示一种数据类型，或者表示程序的结构等，
		//并且关键字不能用作变量名、方法名、类名、包名和参数。

		// 字面值
		//在Java源代码中，字面值是用来表示固定的值。数值型的字面值是最常见的，字符串字面值可以算是一种，
		//当然也可以把特殊的null当做字面值。字面值大体上可以分为整型字面值、浮点字面值、字符和字符串字面值、特殊字面值。

		//字面值就是数据，数据在现实世界中是分门别类的，所以在计算机编程语言中也是分类型的；
		//10、100 属于整数型字面值；
		//true、false属于布尔型字面值；
		//‘A’、‘人’属于字符型字面值；
		//3.14 属于浮点型字面值；
	

	}
}
